#pragma once
#include "header.h"
// ■■■■■ 木の数え上げ ■■■■■


//【森の連結成分の数】
/*
* 森 g の連結成分の個数は，(g の頂点数) - (g の辺数) に等しい．
* 
* verify : https://atcoder.jp/contests/agc015/tasks/agc015_c
*/


//【誘導部分グラフの連結成分の数】
/*
* 根付き木 g の誘導部分グラフ h の連結成分の個数は，
* 親が h に属さない（または g の根である）ような h の頂点の個数に等しい．
* 
* verify : https://atcoder.jp/contests/abc173/tasks/abc173_f
*/


//【独立集合の数え上げ】
/*
* 木DP.h へ
*/


//【部分木の数え上げ】
/*
* 二乗の木DP.h へ
*/


//【木の誘導部分グラフの数え上げ】
/*
* 二乗の木DP.h へ
*/


//【互いに素なパスの数え上げ】
/*
* 二乗の木DP.h へ
*/


//【先祖-子孫関係にない頂点集合の数え上げ】
/*
* 二乗の木DP.h へ
*/


