#pragma once
#include "header.h"
#include "二項係数.h"
// ■■■■■ 束 ■■■■■


//【メビウス反転】
/*
* メビウス反転の具体例を以下に列挙する：
* 
* 通常の大小関係（下位）：
*	g[n] = Σi∈[0..n] f[i]
*	f[n] = g[n] - g[n-1] （g[-1] = 0 とする）
* 
* 通常の大小関係（上位）：
*	g[n] = Σi∈[n..∞) f[i]
*	f[n] = g[n] - g[n+1]
*
* 整除関係（下位）：
*	g[n] = Σd|n f[d]
*	f[n] = Σd|n μ(n/d) g[d] （μ は数論のメビウス関数）
*
* 整除関係（上位）：
*	g[n] = Σn|d f[d]
*	f[n] = Σn|d μ(d/n) g[d] （μ は数論のメビウス関数）
*
* 包含関係（下位）：
*	g[set] = Σsub⊂set f[sub]
*	f[set] = Σsub⊂set (-1)^|set-sub| g[sub]
* 
* 包含関係（上位）：
*	g[set] = Σset⊂sup f[sup]
*	f[set] = Σset⊂sup (-1)^|sup-set| g[sup]
* 
* 包含関係（下位，要素数依存）：
*	g[n] = Σi∈[0..n] bin(n,i) f[i]
*	f[n] = Σi∈[0..n] bin(n,i) (-1)^(n-i) g[i]
*
* 包含関係（上位，要素数依存）：
*	g[n] = Σi∈[n..∞) bin(i,n) f[i]
*	f[n] = Σi∈[n..∞) bin(i,n) (-1)^(i-n) g[i]
*
* 分割束（下位）：
*	g[π] = Σρ:πの細分 f[ρ]
*	f[π] = Σρ:πの細分 μ(π,ρ) g[ρ]
*		μ(π,ρ) = ΠS:πのブロック (-1)^(k-1) (k-1)! （k : S が ρ で何個に分割されるか）
* 
* 分割束（上位）：
*	g[π] = Σπ:ρの細分 f[ρ]
*	f[π] = Σπ:ρの細分 μ(ρ,π) g[ρ]
*		μ(ρ,π) = ΠS:ρのブロック (-1)^(k-1) (k-1)! （k : S が π で何個に分割されるか）
*
* F_q 上部分空間束（下位）：
*	g[V] = ΣW:Vの部分空間 f[W]
*	f[V] = ΣW:Vの部分空間 (-1)^d q^(d(d-1)/2) g[W] （d = dim(V/W)）
*/


//【下位ゼータ変換 ⇔ モノイド半環上での ζ との積】
/*
* R(+,×) を要素の属する半環，M(o) を添字の属するモノイドとし，モノイド半環 R[M] を考える．
* M(o) に半順序 ≦ が
*	i ≦ j ⇔ ∃x∈M(o), i o x = j
* と定義できるものとする．また全ての成分が R(+,×) の乗法単位元 e であるような R[M] の元を
*	ζ = Σi e [i]
* とおく．このとき A = Σi a[i] [i] ∈ R[M] と ζ との積は
*	A ζ
*	= Σk (+_(ioj=k) a[i] × e) [k]
*	= Σk (+_(ioj=k) a[i]) [k]
*	= Σk (+_(i≦k) a[i]) [k]
* となる．係数に注目すると
*	a[k] → +_(i≦k) a[i]
* となっており，これは半順序 ≦ に関する下位ゼータ変換である．
*/


//【max 畳込み ⇔ 各点積】
/*
* M(o,≦) に関して，∀i,j∈M(o) の最小上界 max(i,j) が定まるものとする．R[M] の元
*	A = Σi a[i] [i]
*	B = Σj b[j] [j]
* に ζ を掛けたものの [k] の係数同士の積を計算すると，
*	(A ζ)_[k] × (B ζ)_[k]
*	= (+_(i≦k) a[i]) × (+_(j≦k) b[j])
*	= +_(i≦k) +_(j≦k) a[i] × b[j]
*	= +_(max(i,j)≦k) a[i] × b[j]
*	= +_t≦k +_(max(i,j)=t) a[i] × b[j]
* となる．これは
*	c[k] = +_(max(i,j)=k) a[i] × b[j]
*	C = Σk c[k] [k]
* と定めれば，
*	(A ζ)_[k] × (B ζ)_[k] = (C ζ)_[k]
* と表される．すなわち max に関する畳込みが，「ζ 倍 → 各点積 → 1/ζ 倍」に変換できる．
*/


//【下位ゼータ変換 ⇔ 級数との積】
/*
* M(o) が特定のモノイドのとき，下位ゼータ変換をある種の級数との積と解釈できる．
*
* 大小関係 ≦ : 形式的冪級数 ζ(z) = 1/(1-z)
*	数列 a の下位ゼータ変換 b が
*		b[i] = Σ_(j≦i) a[j]
*	で定義されるとき，これは
*		b[k] = Σ_(i+j=k) a[i] 1[j]
*	と書き直せるので，数列に対応する形式的冪級数を
*		A(z) = Σi a[i] z^i
*	などとおけば，
*		B(z) = A(z) / (1-z)
*	が成り立つ．
*
* 整除関係 | : ディリクレ級数 ζ(s) = Σi 1/i^s（リーマンゼータ関数）
*	数列 a の下位ゼータ変換 b が
*		b[i] = Σ_(j|i) a[j]
*	で定義されるとき，これは
*		b[k] = Σ_(i×j=k) a[i] 1[j]
*	と書き直せるので，数列に対応するディリクレ級数を
*		A(s) = Σi a[i] i^s
*	などとおけば，
*		B(s) = A(s) ζ(s)
*	が成り立つ．
*/


//【メビウス変換・包除原理・除原理の関係？】
/*
* 約数からの寄与を取り除きたい場合を例にする．
*
* 元の式：A[n] = Σd|n a[d]
*	A[1] = a[1]
*	A[2] = a[1] + a[2]
*	A[3] = a[1]        + a[3]
*	A[4] = a[1] + a[2]        + a[4]
*	A[5] = a[1]                      + a[5]
*	A[6] = a[1] + a[2] + a[3]               + a[6]
*	A[7] = a[1]                                    + a[7]
*	A[8] = a[1] + a[2]        + a[4]                      + a[8]
*	A[9] = a[1]        + a[3]                                    + a[9]
*	A[10]= a[1] + a[2]               + a[5]                             + a[10]
*	A[11]= a[1]                                                                + a[11]
*	A[12]= a[1] + a[2] + a[3] + a[4]        + a[6]                                    + a[12]
*
* A[1..12] から a[1..12] を一括で求めたい → 約数メビウス変換
*	a[1] =  A[1]
*	a[2] = -A[1] + A[2]
*	a[3] = -A[1]        + A[3]
*	a[4] =       - A[2]        + A[4]
*	a[5] = -A[1]                      + A[5]
*	a[6] =  A[1] - A[2] - A[3]               + A[6]
*	a[7] = -A[1]                                    + A[7]
*	a[8] =                     - A[4]                      + A[8]
*	a[9] =              - A[3]                                    + A[9]
*	a[10]=  A[1] - A[2]               - A[5]                             + A[10]
*	a[11]= -A[1]                                                                + A[11]
*	a[12]=         A[2]        - A[4]        - A[6]                                    + A[12]
*
* A[1,2,3,4,6,12] から a[12] のみをピンポイントで求めたい → 約数系包除
*	a[12]=         A[2]        - A[4]        - A[6]                                    + A[12]
*
* A[1,2,3,4,6,12] から a[1,2,3,4,6,12] を逐次的に求めたい → 除原理？
*	a[1] =  A[1]
*	a[2] = -a[1] + A[2]
*	a[3] = -a[1]        + A[3]
*	a[4] = -a[1] - a[2]        + A[4]
*	a[6] = -a[1] - a[2] - a[3]               + A[6]
*	a[12]= -a[1] - a[2] - a[3] - a[4]        - a[6]                                    + A[12]
*/


